views/task/index.php


    <div class="task-index">

        <?=
        GridView::widget([
            'dataProvider' => $dataProvider,
            'filterModel' => $searchModel,
            'rowOptions' => function ($model, $key, $index, $grid) {
                return ['id' => 'urg-' . $model['task_urgency']]; //Указываем ID строки = значению важности (task_urgency) для раскраски
            },
            'columns' => [
                ['class' => 'yii\grid\SerialColumn'],
                'task_description:ntext:Описание',

                [
                    'attribute' => 'task_user',
                    'value' => function ($data) {
                        return \app\models\User::findOne(['id' => $data->task_user])->fio;
                    }
                ],

                [
                    'attribute' => 'task_data',
                    'value' => function ($data) {
                        return date('d.m.Y H:i', strtotime($data->task_data));
                    }
---
SELECT COUNT(*) FROM `tbl_task`
SELECT * FROM `tbl_user` WHERE `id`=1