controllers/SiteinfoController.php

    public function actionDelete($id)
    {
        //Проверяем права на удаление
        if (User::isAdmin() or Siteinfo::isAuthor($id)) { //Если админ или автор материала
            //Удаляем папку
            $dir = Siteinfo::findOne(['si_id' => $this->findModel($id)->si_id])->si_path_attach;
---
SELECT * FROM `tbl_siteinfo` WHERE `si_id`='540'