views/site/index.php

$this->title = 'Сервисы администрации ШМР';

if (User::isAdmin()) {
    $countNotPublish = Siteinfo::find()->where(['si_status' => '1'])->count();
---
SELECT COUNT(*) FROM `tbl_siteinfo` WHERE `si_status`='1'