views/siteinfo/_form.php

SELECT * FROM `tbl_statusinfo`
SELECT * FROM `tbl_user` ORDER BY `fio`
SELECT * FROM `tbl_user` WHERE `id`=22
---
    <?php
    if (User::isUserAdmin(Yii::$app->user->identity->username)) {

        $stat_items = ArrayHelper::map(Statusinfo::find()->all(), 'stat_id', 'stat_name');
        echo '<div class="row"><div class="col-md-4">';
        echo $form->field($model, 'si_status')->dropDownList($stat_items);
        echo '</div><div class="col-md-4">';
        $list_user = ArrayHelper::map(User::find()->orderBy(['fio' => 'ASC'])->all(), 'id', 'fio');

        if ($model->si_user_id) {
            $cur_user = User::findOne(['id' => $model->si_user_id])->id;

SELECT * FROM `tbl_division` ORDER BY `div_name`
---
            ]);
        }
        echo '</div><div class="col-md-4">';
        echo $form->field($model, 'si_division_id')->dropDownList(ArrayHelper::map(Division::find()->orderBy(['div_name' => 'ASC'])->all(), 'div_id', 'div_name'))->label('Подразделение');