views/siteinfo/_ftpmodal.php

use yii\helpers\Html;
use app\models\Ftpaccounts;

$list_login = ArrayHelper::map(Ftpaccounts::find()->orderBy(['ftp_login' => 'ASC'])->all(), 'ftp_id', 'ftp_login');
---
SELECT * FROM `tbl_ftpaccounts` ORDER BY `ftp_login`