views/siteinfo/index.php

SELECT * FROM `tbl_user` WHERE `id` IN (22, 39, 20, 36, 32, 31)
---
                            'id' => 'btn-dontpublish-' . $data->si_id,
                        ]);
                    } else {
                        $img = Statusinfo::findOne(['stat_id' => $data->si_status])->stat_name;
                    }
                    return $img;
                }
            ],
            [
                'class' => 'yii\grid\ActionColumn',
                'visibleButtons' => [
                    'delete' => function ($model, $key, $index) {
                        if (User::isUserAdmin() or (Yii::$app->user->identity->id == $model->si_user_id)) {
                            return true;
                        } else {
                            return false;
                        }
                    },
                    'update' => function ($model, $key, $index) {
                        return User::isUserAdmin();
                    }
                ]
            ],
        ],