views/siteinfo/view.php

    } else {
        $endPublic = 'Не указана';
    }
    $division = Division::findOne(['div_id' => $model->si_division_id])->div_name;
---
SELECT * FROM `tbl_division` WHERE `div_id`=8

            'si_id',
            [
                'attribute' => 'si_user_id',
                'value' => User::findOne(['id' => $model->si_user_id])->fio,
---
SELECT * FROM `tbl_user` WHERE `id`=22

                'attribute' => 'si_division_id',
                'label' => 'Подразделение',
                'value' => function ($data) {
                    return Division::findOne(['div_id' => $data->si_division_id])->div_name;
---
SELECT * FROM `tbl_division` WHERE `div_id`=8