models/Birthday.php

    public function attributeLabels()
    {
        return [
            'b_id' => 'Код',
            'b_fio' => 'Ф.И.О.',
            'b_datbirth' => 'Месяц/день рождения',
            'b_tel' => 'Телефон',
            'b_yearbirth' => 'Год рождения',
            'b_notes' => 'Примечание',
        ];
    }

    Public static function getBirthdaymans() {
        $date = date('nd');
        //\yii\helpers\VarDumper::dump($date);
        return Birthday::findAll(['b_datbirth' => $date]);
---
SELECT * FROM `tbl_birthday` WHERE `b_datbirth`='514'