models/Mapinfo.php

SELECT `mi_id`, `mi_parent_id`, `mi_name` FROM `tbl_mapinfo` ORDER BY `mi_name`
---
    public static function getList() {
        $data = static::find()
                ->select(['mi_id', 'mi_parent_id', 'mi_name'])
                ->orderBy('mi_name ASC')
                ->asArray()
                ->all();

SELECT `mi_name`, `mi_parent_id` FROM `tbl_mapinfo` WHERE `mi_id`='239'
---
    public static function getFullpathcategory($id) {
        $path ='';
        while ($id != 0) {
            $info = Mapinfo::find()
                    ->select(['mi_name', 'mi_parent_id'])
                    ->where(['mi_id' => $id])
                    ->asArray()
                    ->one();