models/Siteinfo.php

    static function getNameInfo($infoId)
    {
        return static::findOne(['si_id' => $infoId])->si_name_info;
---
SELECT * FROM `tbl_siteinfo` WHERE `si_id`=540

    public static function sendFtp($model)
    {
        $files = self::getFilesInArray($model->si_path_attach);

        $ftp = new FtpClient();

        if ($model->desiredname) {
            $fileName = $model->desiredname;
        } else {
            $fileName = basename($files[$model->selectedfile]);
        }

        $localPath = $files[$model->selectedfile]; //Путь к локальному файлу
        $query = Ftpaccounts::findOne(['ftp_id' => $model->ftp_id]);
---
SELECT * FROM `tbl_ftpaccounts` WHERE `ftp_id`='3'