models/User.php

SELECT * FROM `tbl_user` WHERE (`id`=1) AND (`status`=10)
---
    public static function findIdentity($id) {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `tbl_user` WHERE (`username`='serdesh') AND (`role`=1)
---
    public static function isAdmin() {
        if (!Yii::$app->user->isGuest) {
            $loggedusername = Yii::$app->user->identity->username;
            if (static::findOne(['username' => $loggedusername, 'role' => 1])) {

SELECT * FROM `tbl_user` WHERE (`username` IN (1, 'serdesh', 'Rg4VUmq98OB4zPwM_ud8FbrIBGSImDT3', '$2y$13$ySpenB/U3v1UEDVBCyILguPObRi9B4XIYhjK7aSDIvgzC0DOo09QO', '7cQMbkH6xVFWixJ6_h2TIaq0Dc-tiRfg_1508412115', 'serdesh77@mail.ru', 10, 1500467935, '1', 'Дешкович Сергей Станиславович', '13', '123987654')) AND (`role`=1)
---
    public static function isUserAdmin() {
        if (!Yii::$app->user->isGuest) {
            $username = Yii::$app->user->identity;
            if ($username) {
                if (static::findOne(['username' => $username, 'role' => 1])) {